syms c1 c2 c3 c4 c5
syms s1 s2 s3 s4 s5
syms d1 a2 a3 a4 d5
syms c23 s23
syms c234 s234

% Ma trận A1
A1 = [c1, -s1, 0, 0;
      s1, c1, 0, 0;
      0, 0, 1, 7.9;
      0, 0, 0, 1];

% Ma trận A2
A2 = [c2, 0, s2, 0;
      0, 1, 0, 0;
      -s2, 0, c2, 1.5;
      0, 0, 0, 1];

% Ma trận A3
A3 = [c3, 0, s3, 0;
      0, 1, 0, 0;
      -s3, 0, c3, 10.5;
      0, 0, 0, 1];

A4 = [c4, 0, s4, 13;
      0, 1, 0, 0;
      -s4, 0, c4, 0;
      0, 0, 0, 1];

A5 = [1, 0, 0, 7.2;
      0, c5, -s5, 0;
      0, s5, c5, 0;
      0, 0, 0, 1];

A6 = [-1, 0, 0, 0;
      0, 1, 0, 0;
      0, 0, -1, 0;
      0, 0, 0, 1];

R4 = [c4, 0, s4;
      0, 1, 0;
      -s4, 0, c4];

R5 = [1, 0, 0;
      0, c5, -s5;
      0, s5, c5];

R6 = [0, 0, 1;
      0, 1, 0;
      -1, 0, 0];

trans = [0; 0; -7.2; 1];

c23 = c2 * c3 - s2 * s3;
s23 = s2 * c3 + c2 * s3;

T123 = A1 * A2 * A3;

T = A1 * A2 * A3 * A4 * A5 * A6 * trans;

R45 = R4 * R5 ;

% Hiển thị kết quả
disp('Ma trận đồng nhất T:');
disp(T);

% Hiển thị kết quả
disp('Ma trận đồng nhất T:');
disp(R45);
